000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. CheckBalance.
000000 
000000 DATA DIVISION.
000000 LINKAGE SECTION.
000000 01 ACCOUNT PIC 9(5).
000000 
000000 PROCEDURE DIVISION USING ACCOUNT.
000000     DISPLAY "Account's Balance : " ACCOUNT.
000000     GOBACK.