000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. MainProgram.
000000 AUTHOR. Romain CHAMBONNIER
000000 DATE-WRITTEN. 2025-03-12.
000000 
000000 
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01 ACCOUNT-1 PIC 9(5) VALUE 1000.
000000 01 ACCOUNT-2 PIC 9(5) VALUE 500.
000000 01 USER-CHOICE PIC 9 VALUE 0.
000000 01 AMOUNT PIC 9(5).
000000 01 END-PROGRAM PIC 9(1) VALUE 0.
000000 
000000 PROCEDURE DIVISION.
000000 MAIN-PROGRAM.
000000 	DISPLAY "WHAT DO YOU WANT TO DO ?"
000000     DISPLAY "1 - Withdraw from ACCOUNT-1".
000000     DISPLAY "2 - Transfert from  ACCOUNT-2".
000000     DISPLAY "3 - Display ACCOUNT-1 balance".
000000     DISPLAY "4 - Quit".
000000     PERFORM UNTIL END-PROGRAM = 1
000000         DISPLAY "Enter your choice : "
000000         ACCEPT USER-CHOICE
000000         EVALUATE USER-CHOICE
000000             WHEN 1
000000                 CALL 'Withdraw' USING ACCOUNT-1
000000             WHEN 2
000000                 CALL 'Transfer' USING ACCOUNT-1 ACCOUNT-2
000000             WHEN 3
000000                 CALL 'CheckBalance' USING ACCOUNT-1
000000             WHEN 4
000000                  MOVE 1 TO END-PROGRAM
000000             WHEN OTHER
000000                 DISPLAY "Invalid choice. Please retry."
000000         END-EVALUATE
000000     END-PERFORM.
000000     STOP RUN.
