000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. Transfer.
000000 
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01 AMOUNT PIC 9(5).
000000 
000000 LINKAGE SECTION.
000000 01 SOURCE-ACCOUNT PIC 9(5).
000000 01 DEST-ACCOUNT PIC 9(5).
000000 
000000 PROCEDURE DIVISION USING SOURCE-ACCOUNT DEST-ACCOUNT.
000000     DISPLAY "Amount to transfer : ".
000000     ACCEPT AMOUNT.
000000     IF AMOUNT <= SOURCE-ACCOUNT THEN
000000         SUBTRACT AMOUNT FROM SOURCE-ACCOUNT
000000         ADD AMOUNT TO DEST-ACCOUNT
000000         DISPLAY "Transfer done."
000000         DISPLAY "New balance SOURCE: " SOURCE-ACCOUNT
000000         DISPLAY "New balance DESTINATION: " DEST-ACCOUNT
000000     ELSE
000000         DISPLAY "Insufficient balance."
000000     END-IF.
000000     GOBACK.
